;******************************************************************************
;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
;* Date/Time created: Sun Dec 02 13:28:37 2018                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../ff.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\brian\Documents\EE445L\Lab11\Test\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("disk_initialize")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("disk_initialize")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\diskio.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$1, DW_AT_decl_column(0x09)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$19)

	.dwendtag $C$DW$1


$C$DW$3	.dwtag  DW_TAG_subprogram

	.dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
$C$DW$761	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$761, DW_AT_name("FR_OK")
	.dwattr $C$DW$761, DW_AT_const_value(0x00)
	.dwattr $C$DW$761, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$761, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$761, DW_AT_decl_column(0x03)

$C$DW$762	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$762, DW_AT_name("FR_DISK_ERR")
	.dwattr $C$DW$762, DW_AT_const_value(0x01)
	.dwattr $C$DW$762, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$762, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$762, DW_AT_decl_column(0x03)

$C$DW$763	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$763, DW_AT_name("FR_INT_ERR")
	.dwattr $C$DW$763, DW_AT_const_value(0x02)
	.dwattr $C$DW$763, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$763, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$763, DW_AT_decl_column(0x03)

$C$DW$764	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$764, DW_AT_name("FR_NOT_READY")
	.dwattr $C$DW$764, DW_AT_const_value(0x03)
	.dwattr $C$DW$764, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$764, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$764, DW_AT_decl_column(0x03)

$C$DW$765	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$765, DW_AT_name("FR_NO_FILE")
	.dwattr $C$DW$765, DW_AT_const_value(0x04)
	.dwattr $C$DW$765, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$765, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$765, DW_AT_decl_column(0x03)

$C$DW$766	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$766, DW_AT_name("FR_NO_PATH")
	.dwattr $C$DW$766, DW_AT_const_value(0x05)
	.dwattr $C$DW$766, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$766, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$766, DW_AT_decl_column(0x03)

$C$DW$767	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$767, DW_AT_name("FR_INVALID_NAME")
	.dwattr $C$DW$767, DW_AT_const_value(0x06)
	.dwattr $C$DW$767, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$767, DW_AT_decl_line(0xba)
	.dwattr $C$DW$767, DW_AT_decl_column(0x03)

$C$DW$768	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$768, DW_AT_name("FR_DENIED")
	.dwattr $C$DW$768, DW_AT_const_value(0x07)
	.dwattr $C$DW$768, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$768, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$768, DW_AT_decl_column(0x03)

$C$DW$769	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$769, DW_AT_name("FR_EXIST")
	.dwattr $C$DW$769, DW_AT_const_value(0x08)
	.dwattr $C$DW$769, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$769, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$769, DW_AT_decl_column(0x03)

$C$DW$770	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$770, DW_AT_name("FR_INVALID_OBJECT")
	.dwattr $C$DW$770, DW_AT_const_value(0x09)
	.dwattr $C$DW$770, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$770, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$770, DW_AT_decl_column(0x03)

$C$DW$771	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$771, DW_AT_name("FR_WRITE_PROTECTED")
	.dwattr $C$DW$771, DW_AT_const_value(0x0a)
	.dwattr $C$DW$771, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$771, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$771, DW_AT_decl_column(0x03)

$C$DW$772	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$772, DW_AT_name("FR_INVALID_DRIVE")
	.dwattr $C$DW$772, DW_AT_const_value(0x0b)
	.dwattr $C$DW$772, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$772, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$772, DW_AT_decl_column(0x03)

$C$DW$773	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$773, DW_AT_name("FR_NOT_ENABLED")
	.dwattr $C$DW$773, DW_AT_const_value(0x0c)
	.dwattr $C$DW$773, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$773, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$773, DW_AT_decl_column(0x03)

$C$DW$774	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$774, DW_AT_name("FR_NO_FILESYSTEM")
	.dwattr $C$DW$774, DW_AT_const_value(0x0d)
	.dwattr $C$DW$774, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$774, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$774, DW_AT_decl_column(0x03)

$C$DW$775	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$775, DW_AT_name("FR_MKFS_ABORTED")
	.dwattr $C$DW$775, DW_AT_const_value(0x0e)
	.dwattr $C$DW$775, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$775, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$775, DW_AT_decl_column(0x03)

$C$DW$776	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$776, DW_AT_name("FR_TIMEOUT")
	.dwattr $C$DW$776, DW_AT_const_value(0x0f)
	.dwattr $C$DW$776, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$776, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$776, DW_AT_decl_column(0x03)

$C$DW$777	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$777, DW_AT_name("FR_LOCKED")
	.dwattr $C$DW$777, DW_AT_const_value(0x10)
	.dwattr $C$DW$777, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$777, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$777, DW_AT_decl_column(0x03)

$C$DW$778	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$778, DW_AT_name("FR_NOT_ENOUGH_CORE")
	.dwattr $C$DW$778, DW_AT_const_value(0x11)
	.dwattr $C$DW$778, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$778, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$778, DW_AT_decl_column(0x03)

$C$DW$779	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$779, DW_AT_name("FR_TOO_MANY_OPEN_FILES")
	.dwattr $C$DW$779, DW_AT_const_value(0x12)
	.dwattr $C$DW$779, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$779, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$779, DW_AT_decl_column(0x03)

$C$DW$780	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$780, DW_AT_name("FR_INVALID_PARAMETER")
	.dwattr $C$DW$780, DW_AT_const_value(0x13)
	.dwattr $C$DW$780, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$780, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$780, DW_AT_decl_column(0x03)

	.dwattr $C$DW$T$44, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$44

$C$DW$T$45	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$45, DW_AT_name("FRESULT")
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$45, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x03)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x234)
$C$DW$781	.dwtag  DW_TAG_member
	.dwattr $C$DW$781, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$781, DW_AT_name("fs_type")
	.dwattr $C$DW$781, DW_AT_TI_symbol_name("fs_type")
	.dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$781, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$781, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$781, DW_AT_decl_column(0x09)

$C$DW$782	.dwtag  DW_TAG_member
	.dwattr $C$DW$782, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$782, DW_AT_name("drv")
	.dwattr $C$DW$782, DW_AT_TI_symbol_name("drv")
	.dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$782, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$782, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$782, DW_AT_decl_column(0x09)

$C$DW$783	.dwtag  DW_TAG_member
	.dwattr $C$DW$783, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$783, DW_AT_name("csize")
	.dwattr $C$DW$783, DW_AT_TI_symbol_name("csize")
	.dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$783, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$783, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$783, DW_AT_decl_column(0x09)

$C$DW$784	.dwtag  DW_TAG_member
	.dwattr $C$DW$784, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$784, DW_AT_name("n_fats")
	.dwattr $C$DW$784, DW_AT_TI_symbol_name("n_fats")
	.dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$784, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$784, DW_AT_decl_line(0x50)
	.dwattr $C$DW$784, DW_AT_decl_column(0x09)

$C$DW$785	.dwtag  DW_TAG_member
	.dwattr $C$DW$785, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$785, DW_AT_name("wflag")
	.dwattr $C$DW$785, DW_AT_TI_symbol_name("wflag")
	.dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$785, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$785, DW_AT_decl_line(0x51)
	.dwattr $C$DW$785, DW_AT_decl_column(0x09)

$C$DW$786	.dwtag  DW_TAG_member
	.dwattr $C$DW$786, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$786, DW_AT_name("fsi_flag")
	.dwattr $C$DW$786, DW_AT_TI_symbol_name("fsi_flag")
	.dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$786, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$786, DW_AT_decl_line(0x52)
	.dwattr $C$DW$786, DW_AT_decl_column(0x09)

$C$DW$787	.dwtag  DW_TAG_member
	.dwattr $C$DW$787, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$787, DW_AT_name("id")
	.dwattr $C$DW$787, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$787, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$787, DW_AT_decl_line(0x53)
	.dwattr $C$DW$787, DW_AT_decl_column(0x09)

$C$DW$788	.dwtag  DW_TAG_member
	.dwattr $C$DW$788, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$788, DW_AT_name("n_rootdir")
	.dwattr $C$DW$788, DW_AT_TI_symbol_name("n_rootdir")
	.dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$788, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$788, DW_AT_decl_line(0x54)
	.dwattr $C$DW$788, DW_AT_decl_column(0x09)

$C$DW$789	.dwtag  DW_TAG_member
	.dwattr $C$DW$789, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$789, DW_AT_name("last_clust")
	.dwattr $C$DW$789, DW_AT_TI_symbol_name("last_clust")
	.dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$789, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$789, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$789, DW_AT_decl_column(0x0a)

$C$DW$790	.dwtag  DW_TAG_member
	.dwattr $C$DW$790, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$790, DW_AT_name("free_clust")
	.dwattr $C$DW$790, DW_AT_TI_symbol_name("free_clust")
	.dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$790, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$790, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$790, DW_AT_decl_column(0x0a)

$C$DW$791	.dwtag  DW_TAG_member
	.dwattr $C$DW$791, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$791, DW_AT_name("cdir")
	.dwattr $C$DW$791, DW_AT_TI_symbol_name("cdir")
	.dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$791, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$791, DW_AT_decl_line(0x60)
	.dwattr $C$DW$791, DW_AT_decl_column(0x0a)

$C$DW$792	.dwtag  DW_TAG_member
	.dwattr $C$DW$792, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$792, DW_AT_name("n_fatent")
	.dwattr $C$DW$792, DW_AT_TI_symbol_name("n_fatent")
	.dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$792, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$792, DW_AT_decl_line(0x62)
	.dwattr $C$DW$792, DW_AT_decl_column(0x0a)

$C$DW$793	.dwtag  DW_TAG_member
	.dwattr $C$DW$793, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$793, DW_AT_name("fsize")
	.dwattr $C$DW$793, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$793, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$793, DW_AT_decl_line(0x63)
	.dwattr $C$DW$793, DW_AT_decl_column(0x0a)

$C$DW$794	.dwtag  DW_TAG_member
	.dwattr $C$DW$794, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$794, DW_AT_name("volbase")
	.dwattr $C$DW$794, DW_AT_TI_symbol_name("volbase")
	.dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$794, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$794, DW_AT_decl_line(0x64)
	.dwattr $C$DW$794, DW_AT_decl_column(0x0a)

$C$DW$795	.dwtag  DW_TAG_member
	.dwattr $C$DW$795, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$795, DW_AT_name("fatbase")
	.dwattr $C$DW$795, DW_AT_TI_symbol_name("fatbase")
	.dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$795, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$795, DW_AT_decl_line(0x65)
	.dwattr $C$DW$795, DW_AT_decl_column(0x0a)

$C$DW$796	.dwtag  DW_TAG_member
	.dwattr $C$DW$796, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$796, DW_AT_name("dirbase")
	.dwattr $C$DW$796, DW_AT_TI_symbol_name("dirbase")
	.dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$796, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$796, DW_AT_decl_line(0x66)
	.dwattr $C$DW$796, DW_AT_decl_column(0x0a)

$C$DW$797	.dwtag  DW_TAG_member
	.dwattr $C$DW$797, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$797, DW_AT_name("database")
	.dwattr $C$DW$797, DW_AT_TI_symbol_name("database")
	.dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$797, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$797, DW_AT_decl_line(0x67)
	.dwattr $C$DW$797, DW_AT_decl_column(0x0a)

$C$DW$798	.dwtag  DW_TAG_member
	.dwattr $C$DW$798, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$798, DW_AT_name("winsect")
	.dwattr $C$DW$798, DW_AT_TI_symbol_name("winsect")
	.dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$798, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$798, DW_AT_decl_line(0x68)
	.dwattr $C$DW$798, DW_AT_decl_column(0x0a)

$C$DW$799	.dwtag  DW_TAG_member
	.dwattr $C$DW$799, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$799, DW_AT_name("win")
	.dwattr $C$DW$799, DW_AT_TI_symbol_name("win")
	.dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$799, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$799, DW_AT_decl_line(0x69)
	.dwattr $C$DW$799, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$23

$C$DW$T$24	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$24, DW_AT_name("FATFS")
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x03)

$C$DW$T$25	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_address_class(0x20)

$C$DW$T$67	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$67, DW_AT_address_class(0x20)


$C$DW$T$100	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
$C$DW$800	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$800, DW_AT_upper_bound(0x00)

	.dwendtag $C$DW$T$100


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x1c)
$C$DW$801	.dwtag  DW_TAG_member
	.dwattr $C$DW$801, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$801, DW_AT_name("fs")
	.dwattr $C$DW$801, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$801, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$801, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$801, DW_AT_decl_column(0x0b)

$C$DW$802	.dwtag  DW_TAG_member
	.dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$802, DW_AT_name("id")
	.dwattr $C$DW$802, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$802, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$802, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$802, DW_AT_decl_column(0x09)

$C$DW$803	.dwtag  DW_TAG_member
	.dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$803, DW_AT_name("index")
	.dwattr $C$DW$803, DW_AT_TI_symbol_name("index")
	.dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$803, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$803, DW_AT_decl_line(0x90)
	.dwattr $C$DW$803, DW_AT_decl_column(0x09)

$C$DW$804	.dwtag  DW_TAG_member
	.dwattr $C$DW$804, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$804, DW_AT_name("sclust")
	.dwattr $C$DW$804, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$804, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$804, DW_AT_decl_line(0x91)
	.dwattr $C$DW$804, DW_AT_decl_column(0x0a)

$C$DW$805	.dwtag  DW_TAG_member
	.dwattr $C$DW$805, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$805, DW_AT_name("clust")
	.dwattr $C$DW$805, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$805, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$805, DW_AT_decl_line(0x92)
	.dwattr $C$DW$805, DW_AT_decl_column(0x0a)

$C$DW$806	.dwtag  DW_TAG_member
	.dwattr $C$DW$806, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$806, DW_AT_name("sect")
	.dwattr $C$DW$806, DW_AT_TI_symbol_name("sect")
	.dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$806, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$806, DW_AT_decl_line(0x93)
	.dwattr $C$DW$806, DW_AT_decl_column(0x0a)

$C$DW$807	.dwtag  DW_TAG_member
	.dwattr $C$DW$807, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$807, DW_AT_name("dir")
	.dwattr $C$DW$807, DW_AT_TI_symbol_name("dir")
	.dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$807, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$807, DW_AT_decl_line(0x94)
	.dwattr $C$DW$807, DW_AT_decl_column(0x0a)

$C$DW$808	.dwtag  DW_TAG_member
	.dwattr $C$DW$808, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$808, DW_AT_name("fn")
	.dwattr $C$DW$808, DW_AT_TI_symbol_name("fn")
	.dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$808, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$808, DW_AT_decl_line(0x95)
	.dwattr $C$DW$808, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$27, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$27

$C$DW$T$52	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$52, DW_AT_name("DIR")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$52, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x03)

$C$DW$T$53	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_address_class(0x20)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x18)
$C$DW$809	.dwtag  DW_TAG_member
	.dwattr $C$DW$809, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$809, DW_AT_name("fsize")
	.dwattr $C$DW$809, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$809, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$809, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$809, DW_AT_decl_column(0x0a)

$C$DW$810	.dwtag  DW_TAG_member
	.dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$810, DW_AT_name("fdate")
	.dwattr $C$DW$810, DW_AT_TI_symbol_name("fdate")
	.dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$810, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$810, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$810, DW_AT_decl_column(0x09)

$C$DW$811	.dwtag  DW_TAG_member
	.dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$811, DW_AT_name("ftime")
	.dwattr $C$DW$811, DW_AT_TI_symbol_name("ftime")
	.dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$811, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$811, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$811, DW_AT_decl_column(0x09)

$C$DW$812	.dwtag  DW_TAG_member
	.dwattr $C$DW$812, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$812, DW_AT_name("fattrib")
	.dwattr $C$DW$812, DW_AT_TI_symbol_name("fattrib")
	.dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$812, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$812, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$812, DW_AT_decl_column(0x09)

$C$DW$813	.dwtag  DW_TAG_member
	.dwattr $C$DW$813, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$813, DW_AT_name("fname")
	.dwattr $C$DW$813, DW_AT_TI_symbol_name("fname")
	.dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$813, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$813, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$813, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

$C$DW$T$87	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$87, DW_AT_name("FILINFO")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$87, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x03)

$C$DW$T$95	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$87)

$C$DW$T$96	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$96, DW_AT_address_class(0x20)

$C$DW$T$88	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_address_class(0x20)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x224)
$C$DW$814	.dwtag  DW_TAG_member
	.dwattr $C$DW$814, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$814, DW_AT_name("fs")
	.dwattr $C$DW$814, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$814, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$814, DW_AT_decl_line(0x71)
	.dwattr $C$DW$814, DW_AT_decl_column(0x0b)

$C$DW$815	.dwtag  DW_TAG_member
	.dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$815, DW_AT_name("id")
	.dwattr $C$DW$815, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$815, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$815, DW_AT_decl_line(0x72)
	.dwattr $C$DW$815, DW_AT_decl_column(0x09)

$C$DW$816	.dwtag  DW_TAG_member
	.dwattr $C$DW$816, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$816, DW_AT_name("flag")
	.dwattr $C$DW$816, DW_AT_TI_symbol_name("flag")
	.dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$816, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$816, DW_AT_decl_line(0x73)
	.dwattr $C$DW$816, DW_AT_decl_column(0x09)

$C$DW$817	.dwtag  DW_TAG_member
	.dwattr $C$DW$817, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$817, DW_AT_name("err")
	.dwattr $C$DW$817, DW_AT_TI_symbol_name("err")
	.dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$817, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$817, DW_AT_decl_line(0x74)
	.dwattr $C$DW$817, DW_AT_decl_column(0x09)

$C$DW$818	.dwtag  DW_TAG_member
	.dwattr $C$DW$818, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$818, DW_AT_name("fptr")
	.dwattr $C$DW$818, DW_AT_TI_symbol_name("fptr")
	.dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$818, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$818, DW_AT_decl_line(0x75)
	.dwattr $C$DW$818, DW_AT_decl_column(0x0a)

$C$DW$819	.dwtag  DW_TAG_member
	.dwattr $C$DW$819, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$819, DW_AT_name("fsize")
	.dwattr $C$DW$819, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$819, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$819, DW_AT_decl_line(0x76)
	.dwattr $C$DW$819, DW_AT_decl_column(0x0a)

$C$DW$820	.dwtag  DW_TAG_member
	.dwattr $C$DW$820, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$820, DW_AT_name("sclust")
	.dwattr $C$DW$820, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$820, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$820, DW_AT_decl_line(0x77)
	.dwattr $C$DW$820, DW_AT_decl_column(0x0a)

$C$DW$821	.dwtag  DW_TAG_member
	.dwattr $C$DW$821, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$821, DW_AT_name("clust")
	.dwattr $C$DW$821, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$821, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$821, DW_AT_decl_line(0x78)
	.dwattr $C$DW$821, DW_AT_decl_column(0x0a)

$C$DW$822	.dwtag  DW_TAG_member
	.dwattr $C$DW$822, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$822, DW_AT_name("dsect")
	.dwattr $C$DW$822, DW_AT_TI_symbol_name("dsect")
	.dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$822, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$822, DW_AT_decl_line(0x79)
	.dwattr $C$DW$822, DW_AT_decl_column(0x0a)

$C$DW$823	.dwtag  DW_TAG_member
	.dwattr $C$DW$823, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$823, DW_AT_name("dir_sect")
	.dwattr $C$DW$823, DW_AT_TI_symbol_name("dir_sect")
	.dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$823, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$823, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$823, DW_AT_decl_column(0x0a)

$C$DW$824	.dwtag  DW_TAG_member
	.dwattr $C$DW$824, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$824, DW_AT_name("dir_ptr")
	.dwattr $C$DW$824, DW_AT_TI_symbol_name("dir_ptr")
	.dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$824, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$824, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$824, DW_AT_decl_column(0x0a)

$C$DW$825	.dwtag  DW_TAG_member
	.dwattr $C$DW$825, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$825, DW_AT_name("buf")
	.dwattr $C$DW$825, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$825, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$825, DW_AT_decl_line(0x85)
	.dwattr $C$DW$825, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$32

$C$DW$T$73	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$73, DW_AT_name("FIL")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("..\ff.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x03)

$C$DW$T$74	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$74, DW_AT_address_class(0x20)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$78	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$2)

$C$DW$T$79	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_address_class(0x20)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$19	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$19, DW_AT_name("BYTE")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_decl_file("..\integer.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x10)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x17)

$C$DW$T$38	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)

$C$DW$T$39	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x20)

$C$DW$T$109	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$109, DW_AT_name("DSTATUS")
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$109, DW_AT_decl_file("..\diskio.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0x14)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x0f)


$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x200)
$C$DW$826	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$826, DW_AT_upper_bound(0x1ff)

	.dwendtag $C$DW$T$22

$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)


$C$DW$T$114	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x0c)
$C$DW$827	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$827, DW_AT_upper_bound(0x0b)

	.dwendtag $C$DW$T$114


$C$DW$T$115	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$115, DW_AT_byte_size(0x15)
$C$DW$828	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$828, DW_AT_upper_bound(0x14)

	.dwendtag $C$DW$T$115


$C$DW$T$116	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$116, DW_AT_byte_size(0x0b)
$C$DW$829	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$829, DW_AT_upper_bound(0x0a)

	.dwendtag $C$DW$T$116

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
