TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Sun Dec 02 13:28:37 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../ff.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\brian\Documents\EE445L\Lab11\Test\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("disk_initialize")

ff.asm                                                               PAGE  404

   22079                            .dwattr $C$DW$772, DW_AT_decl_file("..\ff.h")
   22080                            .dwattr $C$DW$772, DW_AT_decl_line(0xbf)
   22081                            .dwattr $C$DW$772, DW_AT_decl_column(0x03)
   22082                    
   22083                    $C$DW$773       .dwtag  DW_TAG_enumerator
   22084                            .dwattr $C$DW$773, DW_AT_name("FR_NOT_ENABLED")
   22085                            .dwattr $C$DW$773, DW_AT_const_value(0x0c)
   22086                            .dwattr $C$DW$773, DW_AT_decl_file("..\ff.h")
   22087                            .dwattr $C$DW$773, DW_AT_decl_line(0xc0)
   22088                            .dwattr $C$DW$773, DW_AT_decl_column(0x03)
   22089                    
   22090                    $C$DW$774       .dwtag  DW_TAG_enumerator
   22091                            .dwattr $C$DW$774, DW_AT_name("FR_NO_FILESYSTEM")
   22092                            .dwattr $C$DW$774, DW_AT_const_value(0x0d)
   22093                            .dwattr $C$DW$774, DW_AT_decl_file("..\ff.h")
   22094                            .dwattr $C$DW$774, DW_AT_decl_line(0xc1)
   22095                            .dwattr $C$DW$774, DW_AT_decl_column(0x03)
   22096                    
   22097                    $C$DW$775       .dwtag  DW_TAG_enumerator
   22098                            .dwattr $C$DW$775, DW_AT_name("FR_MKFS_ABORTED")
   22099                            .dwattr $C$DW$775, DW_AT_const_value(0x0e)
   22100                            .dwattr $C$DW$775, DW_AT_decl_file("..\ff.h")
   22101                            .dwattr $C$DW$775, DW_AT_decl_line(0xc2)
   22102                            .dwattr $C$DW$775, DW_AT_decl_column(0x03)
   22103                    
   22104                    $C$DW$776       .dwtag  DW_TAG_enumerator
   22105                            .dwattr $C$DW$776, DW_AT_name("FR_TIMEOUT")
   22106                            .dwattr $C$DW$776, DW_AT_const_value(0x0f)
   22107                            .dwattr $C$DW$776, DW_AT_decl_file("..\ff.h")
   22108                            .dwattr $C$DW$776, DW_AT_decl_line(0xc3)
   22109                            .dwattr $C$DW$776, DW_AT_decl_column(0x03)
   22110                    
   22111                    $C$DW$777       .dwtag  DW_TAG_enumerator
   22112                            .dwattr $C$DW$777, DW_AT_name("FR_LOCKED")
   22113                            .dwattr $C$DW$777, DW_AT_const_value(0x10)
   22114                            .dwattr $C$DW$777, DW_AT_decl_file("..\ff.h")
   22115                            .dwattr $C$DW$777, DW_AT_decl_line(0xc4)
   22116                            .dwattr $C$DW$777, DW_AT_decl_column(0x03)
   22117                    
   22118                    $C$DW$778       .dwtag  DW_TAG_enumerator
   22119                            .dwattr $C$DW$778, DW_AT_name("FR_NOT_ENOUGH_CORE")
   22120                            .dwattr $C$DW$778, DW_AT_const_value(0x11)
   22121                            .dwattr $C$DW$778, DW_AT_decl_file("..\ff.h")
   22122                            .dwattr $C$DW$778, DW_AT_decl_line(0xc5)
   22123                            .dwattr $C$DW$778, DW_AT_decl_column(0x03)
   22124                    
   22125                    $C$DW$779       .dwtag  DW_TAG_enumerator
   22126                            .dwattr $C$DW$779, DW_AT_name("FR_TOO_MANY_OPEN_FILES")
   22127                            .dwattr $C$DW$779, DW_AT_const_value(0x12)
   22128                            .dwattr $C$DW$779, DW_AT_decl_file("..\ff.h")
   22129                            .dwattr $C$DW$779, DW_AT_decl_line(0xc6)
   22130                            .dwattr $C$DW$779, DW_AT_decl_column(0x03)
   22131                    
   22132                    $C$DW$780       .dwtag  DW_TAG_enumerator
   22133                            .dwattr $C$DW$780, DW_AT_name("FR_INVALID_PARAMETER")
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  405

   22134                            .dwattr $C$DW$780, DW_AT_const_value(0x13)
   22135                            .dwattr $C$DW$780, DW_AT_decl_file("..\ff.h")
   22136                            .dwattr $C$DW$780, DW_AT_decl_line(0xc7)
   22137                            .dwattr $C$DW$780, DW_AT_decl_column(0x03)
   22138                    
   22139                            .dwattr $C$DW$T$44, DW_AT_decl_file("..\ff.h")
   22140                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xb3)
   22141                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0e)
   22142                            .dwendtag $C$DW$T$44
   22143                    
   22144                    $C$DW$T$45      .dwtag  DW_TAG_typedef
   22145                            .dwattr $C$DW$T$45, DW_AT_name("FRESULT")
   22146                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
   22147                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
   22148                            .dwattr $C$DW$T$45, DW_AT_decl_file("..\ff.h")
   22149                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xc8)
   22150                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
   22151                    
   22152                    
   22153                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
   22154                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x234)
   22155                    $C$DW$781       .dwtag  DW_TAG_member
   22156                            .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$19)
   22157                            .dwattr $C$DW$781, DW_AT_name("fs_type")
   22158                            .dwattr $C$DW$781, DW_AT_TI_symbol_name("fs_type")
   22159                            .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22160                            .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
   22161                            .dwattr $C$DW$781, DW_AT_decl_file("..\ff.h")
   22162                            .dwattr $C$DW$781, DW_AT_decl_line(0x4d)
   22163                            .dwattr $C$DW$781, DW_AT_decl_column(0x09)
   22164                    
   22165                    $C$DW$782       .dwtag  DW_TAG_member
   22166                            .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$19)
   22167                            .dwattr $C$DW$782, DW_AT_name("drv")
   22168                            .dwattr $C$DW$782, DW_AT_TI_symbol_name("drv")
   22169                            .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   22170                            .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
   22171                            .dwattr $C$DW$782, DW_AT_decl_file("..\ff.h")
   22172                            .dwattr $C$DW$782, DW_AT_decl_line(0x4e)
   22173                            .dwattr $C$DW$782, DW_AT_decl_column(0x09)
   22174                    
   22175                    $C$DW$783       .dwtag  DW_TAG_member
   22176                            .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$19)
   22177                            .dwattr $C$DW$783, DW_AT_name("csize")
   22178                            .dwattr $C$DW$783, DW_AT_TI_symbol_name("csize")
   22179                            .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   22180                            .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
   22181                            .dwattr $C$DW$783, DW_AT_decl_file("..\ff.h")
   22182                            .dwattr $C$DW$783, DW_AT_decl_line(0x4f)
   22183                            .dwattr $C$DW$783, DW_AT_decl_column(0x09)
   22184                    
   22185                    $C$DW$784       .dwtag  DW_TAG_member
   22186                            .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$19)
   22187                            .dwattr $C$DW$784, DW_AT_name("n_fats")
   22188                            .dwattr $C$DW$784, DW_AT_TI_symbol_name("n_fats")
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  406

   22189                            .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   22190                            .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
   22191                            .dwattr $C$DW$784, DW_AT_decl_file("..\ff.h")
   22192                            .dwattr $C$DW$784, DW_AT_decl_line(0x50)
   22193                            .dwattr $C$DW$784, DW_AT_decl_column(0x09)
   22194                    
   22195                    $C$DW$785       .dwtag  DW_TAG_member
   22196                            .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$19)
   22197                            .dwattr $C$DW$785, DW_AT_name("wflag")
   22198                            .dwattr $C$DW$785, DW_AT_TI_symbol_name("wflag")
   22199                            .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   22200                            .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
   22201                            .dwattr $C$DW$785, DW_AT_decl_file("..\ff.h")
   22202                            .dwattr $C$DW$785, DW_AT_decl_line(0x51)
   22203                            .dwattr $C$DW$785, DW_AT_decl_column(0x09)
   22204                    
   22205                    $C$DW$786       .dwtag  DW_TAG_member
   22206                            .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$19)
   22207                            .dwattr $C$DW$786, DW_AT_name("fsi_flag")
   22208                            .dwattr $C$DW$786, DW_AT_TI_symbol_name("fsi_flag")
   22209                            .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   22210                            .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
   22211                            .dwattr $C$DW$786, DW_AT_decl_file("..\ff.h")
   22212                            .dwattr $C$DW$786, DW_AT_decl_line(0x52)
   22213                            .dwattr $C$DW$786, DW_AT_decl_column(0x09)
   22214                    
   22215                    $C$DW$787       .dwtag  DW_TAG_member
   22216                            .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$20)
   22217                            .dwattr $C$DW$787, DW_AT_name("id")
   22218                            .dwattr $C$DW$787, DW_AT_TI_symbol_name("id")
   22219                            .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   22220                            .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
   22221                            .dwattr $C$DW$787, DW_AT_decl_file("..\ff.h")
   22222                            .dwattr $C$DW$787, DW_AT_decl_line(0x53)
   22223                            .dwattr $C$DW$787, DW_AT_decl_column(0x09)
   22224                    
   22225                    $C$DW$788       .dwtag  DW_TAG_member
   22226                            .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$20)
   22227                            .dwattr $C$DW$788, DW_AT_name("n_rootdir")
   22228                            .dwattr $C$DW$788, DW_AT_TI_symbol_name("n_rootdir")
   22229                            .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   22230                            .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
   22231                            .dwattr $C$DW$788, DW_AT_decl_file("..\ff.h")
   22232                            .dwattr $C$DW$788, DW_AT_decl_line(0x54)
   22233                            .dwattr $C$DW$788, DW_AT_decl_column(0x09)
   22234                    
   22235                    $C$DW$789       .dwtag  DW_TAG_member
   22236                            .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$21)
   22237                            .dwattr $C$DW$789, DW_AT_name("last_clust")
   22238                            .dwattr $C$DW$789, DW_AT_TI_symbol_name("last_clust")
   22239                            .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   22240                            .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
   22241                            .dwattr $C$DW$789, DW_AT_decl_file("..\ff.h")
   22242                            .dwattr $C$DW$789, DW_AT_decl_line(0x5c)
   22243                            .dwattr $C$DW$789, DW_AT_decl_column(0x0a)
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  407

   22244                    
   22245                    $C$DW$790       .dwtag  DW_TAG_member
   22246                            .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$21)
   22247                            .dwattr $C$DW$790, DW_AT_name("free_clust")
   22248                            .dwattr $C$DW$790, DW_AT_TI_symbol_name("free_clust")
   22249                            .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   22250                            .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
   22251                            .dwattr $C$DW$790, DW_AT_decl_file("..\ff.h")
   22252                            .dwattr $C$DW$790, DW_AT_decl_line(0x5d)
   22253                            .dwattr $C$DW$790, DW_AT_decl_column(0x0a)
   22254                    
   22255                    $C$DW$791       .dwtag  DW_TAG_member
   22256                            .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$21)
   22257                            .dwattr $C$DW$791, DW_AT_name("cdir")
   22258                            .dwattr $C$DW$791, DW_AT_TI_symbol_name("cdir")
   22259                            .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   22260                            .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
   22261                            .dwattr $C$DW$791, DW_AT_decl_file("..\ff.h")
   22262                            .dwattr $C$DW$791, DW_AT_decl_line(0x60)
   22263                            .dwattr $C$DW$791, DW_AT_decl_column(0x0a)
   22264                    
   22265                    $C$DW$792       .dwtag  DW_TAG_member
   22266                            .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$21)
   22267                            .dwattr $C$DW$792, DW_AT_name("n_fatent")
   22268                            .dwattr $C$DW$792, DW_AT_TI_symbol_name("n_fatent")
   22269                            .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   22270                            .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
   22271                            .dwattr $C$DW$792, DW_AT_decl_file("..\ff.h")
   22272                            .dwattr $C$DW$792, DW_AT_decl_line(0x62)
   22273                            .dwattr $C$DW$792, DW_AT_decl_column(0x0a)
   22274                    
   22275                    $C$DW$793       .dwtag  DW_TAG_member
   22276                            .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$21)
   22277                            .dwattr $C$DW$793, DW_AT_name("fsize")
   22278                            .dwattr $C$DW$793, DW_AT_TI_symbol_name("fsize")
   22279                            .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   22280                            .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
   22281                            .dwattr $C$DW$793, DW_AT_decl_file("..\ff.h")
   22282                            .dwattr $C$DW$793, DW_AT_decl_line(0x63)
   22283                            .dwattr $C$DW$793, DW_AT_decl_column(0x0a)
   22284                    
   22285                    $C$DW$794       .dwtag  DW_TAG_member
   22286                            .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$21)
   22287                            .dwattr $C$DW$794, DW_AT_name("volbase")
   22288                            .dwattr $C$DW$794, DW_AT_TI_symbol_name("volbase")
   22289                            .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   22290                            .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
   22291                            .dwattr $C$DW$794, DW_AT_decl_file("..\ff.h")
   22292                            .dwattr $C$DW$794, DW_AT_decl_line(0x64)
   22293                            .dwattr $C$DW$794, DW_AT_decl_column(0x0a)
   22294                    
   22295                    $C$DW$795       .dwtag  DW_TAG_member
   22296                            .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$21)
   22297                            .dwattr $C$DW$795, DW_AT_name("fatbase")
   22298                            .dwattr $C$DW$795, DW_AT_TI_symbol_name("fatbase")
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  408

   22299                            .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   22300                            .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
   22301                            .dwattr $C$DW$795, DW_AT_decl_file("..\ff.h")
   22302                            .dwattr $C$DW$795, DW_AT_decl_line(0x65)
   22303                            .dwattr $C$DW$795, DW_AT_decl_column(0x0a)
   22304                    
   22305                    $C$DW$796       .dwtag  DW_TAG_member
   22306                            .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$21)
   22307                            .dwattr $C$DW$796, DW_AT_name("dirbase")
   22308                            .dwattr $C$DW$796, DW_AT_TI_symbol_name("dirbase")
   22309                            .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   22310                            .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
   22311                            .dwattr $C$DW$796, DW_AT_decl_file("..\ff.h")
   22312                            .dwattr $C$DW$796, DW_AT_decl_line(0x66)
   22313                            .dwattr $C$DW$796, DW_AT_decl_column(0x0a)
   22314                    
   22315                    $C$DW$797       .dwtag  DW_TAG_member
   22316                            .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$21)
   22317                            .dwattr $C$DW$797, DW_AT_name("database")
   22318                            .dwattr $C$DW$797, DW_AT_TI_symbol_name("database")
   22319                            .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   22320                            .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
   22321                            .dwattr $C$DW$797, DW_AT_decl_file("..\ff.h")
   22322                            .dwattr $C$DW$797, DW_AT_decl_line(0x67)
   22323                            .dwattr $C$DW$797, DW_AT_decl_column(0x0a)
   22324                    
   22325                    $C$DW$798       .dwtag  DW_TAG_member
   22326                            .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$21)
   22327                            .dwattr $C$DW$798, DW_AT_name("winsect")
   22328                            .dwattr $C$DW$798, DW_AT_TI_symbol_name("winsect")
   22329                            .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   22330                            .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
   22331                            .dwattr $C$DW$798, DW_AT_decl_file("..\ff.h")
   22332                            .dwattr $C$DW$798, DW_AT_decl_line(0x68)
   22333                            .dwattr $C$DW$798, DW_AT_decl_column(0x0a)
   22334                    
   22335                    $C$DW$799       .dwtag  DW_TAG_member
   22336                            .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$22)
   22337                            .dwattr $C$DW$799, DW_AT_name("win")
   22338                            .dwattr $C$DW$799, DW_AT_TI_symbol_name("win")
   22339                            .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   22340                            .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
   22341                            .dwattr $C$DW$799, DW_AT_decl_file("..\ff.h")
   22342                            .dwattr $C$DW$799, DW_AT_decl_line(0x69)
   22343                            .dwattr $C$DW$799, DW_AT_decl_column(0x09)
   22344                    
   22345                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\ff.h")
   22346                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4c)
   22347                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
   22348                            .dwendtag $C$DW$T$23
   22349                    
   22350                    $C$DW$T$24      .dwtag  DW_TAG_typedef
   22351                            .dwattr $C$DW$T$24, DW_AT_name("FATFS")
   22352                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
   22353                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  409

   22354                            .dwattr $C$DW$T$24, DW_AT_decl_file("..\ff.h")
   22355                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x6a)
   22356                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
   22357                    
   22358                    $C$DW$T$25      .dwtag  DW_TAG_pointer_type
   22359                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
   22360                            .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
   22361                    
   22362                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
   22363                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
   22364                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
   22365                    
   22366                    
   22367                    $C$DW$T$100     .dwtag  DW_TAG_array_type
   22368                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$25)
   22369                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
   22370                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
   22371                    $C$DW$800       .dwtag  DW_TAG_subrange_type
   22372                            .dwattr $C$DW$800, DW_AT_upper_bound(0x00)
   22373                    
   22374                            .dwendtag $C$DW$T$100
   22375                    
   22376                    
   22377                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
   22378                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x1c)
   22379                    $C$DW$801       .dwtag  DW_TAG_member
   22380                            .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$25)
   22381                            .dwattr $C$DW$801, DW_AT_name("fs")
   22382                            .dwattr $C$DW$801, DW_AT_TI_symbol_name("fs")
   22383                            .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22384                            .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
   22385                            .dwattr $C$DW$801, DW_AT_decl_file("..\ff.h")
   22386                            .dwattr $C$DW$801, DW_AT_decl_line(0x8e)
   22387                            .dwattr $C$DW$801, DW_AT_decl_column(0x0b)
   22388                    
   22389                    $C$DW$802       .dwtag  DW_TAG_member
   22390                            .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
   22391                            .dwattr $C$DW$802, DW_AT_name("id")
   22392                            .dwattr $C$DW$802, DW_AT_TI_symbol_name("id")
   22393                            .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   22394                            .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
   22395                            .dwattr $C$DW$802, DW_AT_decl_file("..\ff.h")
   22396                            .dwattr $C$DW$802, DW_AT_decl_line(0x8f)
   22397                            .dwattr $C$DW$802, DW_AT_decl_column(0x09)
   22398                    
   22399                    $C$DW$803       .dwtag  DW_TAG_member
   22400                            .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
   22401                            .dwattr $C$DW$803, DW_AT_name("index")
   22402                            .dwattr $C$DW$803, DW_AT_TI_symbol_name("index")
   22403                            .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   22404                            .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
   22405                            .dwattr $C$DW$803, DW_AT_decl_file("..\ff.h")
   22406                            .dwattr $C$DW$803, DW_AT_decl_line(0x90)
   22407                            .dwattr $C$DW$803, DW_AT_decl_column(0x09)
   22408                    
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  410

   22409                    $C$DW$804       .dwtag  DW_TAG_member
   22410                            .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$21)
   22411                            .dwattr $C$DW$804, DW_AT_name("sclust")
   22412                            .dwattr $C$DW$804, DW_AT_TI_symbol_name("sclust")
   22413                            .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   22414                            .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
   22415                            .dwattr $C$DW$804, DW_AT_decl_file("..\ff.h")
   22416                            .dwattr $C$DW$804, DW_AT_decl_line(0x91)
   22417                            .dwattr $C$DW$804, DW_AT_decl_column(0x0a)
   22418                    
   22419                    $C$DW$805       .dwtag  DW_TAG_member
   22420                            .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$21)
   22421                            .dwattr $C$DW$805, DW_AT_name("clust")
   22422                            .dwattr $C$DW$805, DW_AT_TI_symbol_name("clust")
   22423                            .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   22424                            .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
   22425                            .dwattr $C$DW$805, DW_AT_decl_file("..\ff.h")
   22426                            .dwattr $C$DW$805, DW_AT_decl_line(0x92)
   22427                            .dwattr $C$DW$805, DW_AT_decl_column(0x0a)
   22428                    
   22429                    $C$DW$806       .dwtag  DW_TAG_member
   22430                            .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$21)
   22431                            .dwattr $C$DW$806, DW_AT_name("sect")
   22432                            .dwattr $C$DW$806, DW_AT_TI_symbol_name("sect")
   22433                            .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   22434                            .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
   22435                            .dwattr $C$DW$806, DW_AT_decl_file("..\ff.h")
   22436                            .dwattr $C$DW$806, DW_AT_decl_line(0x93)
   22437                            .dwattr $C$DW$806, DW_AT_decl_column(0x0a)
   22438                    
   22439                    $C$DW$807       .dwtag  DW_TAG_member
   22440                            .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$26)
   22441                            .dwattr $C$DW$807, DW_AT_name("dir")
   22442                            .dwattr $C$DW$807, DW_AT_TI_symbol_name("dir")
   22443                            .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   22444                            .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
   22445                            .dwattr $C$DW$807, DW_AT_decl_file("..\ff.h")
   22446                            .dwattr $C$DW$807, DW_AT_decl_line(0x94)
   22447                            .dwattr $C$DW$807, DW_AT_decl_column(0x0a)
   22448                    
   22449                    $C$DW$808       .dwtag  DW_TAG_member
   22450                            .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$26)
   22451                            .dwattr $C$DW$808, DW_AT_name("fn")
   22452                            .dwattr $C$DW$808, DW_AT_TI_symbol_name("fn")
   22453                            .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   22454                            .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
   22455                            .dwattr $C$DW$808, DW_AT_decl_file("..\ff.h")
   22456                            .dwattr $C$DW$808, DW_AT_decl_line(0x95)
   22457                            .dwattr $C$DW$808, DW_AT_decl_column(0x0a)
   22458                    
   22459                            .dwattr $C$DW$T$27, DW_AT_decl_file("..\ff.h")
   22460                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x8d)
   22461                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
   22462                            .dwendtag $C$DW$T$27
   22463                    
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  411

   22464                    $C$DW$T$52      .dwtag  DW_TAG_typedef
   22465                            .dwattr $C$DW$T$52, DW_AT_name("DIR")
   22466                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$27)
   22467                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
   22468                            .dwattr $C$DW$T$52, DW_AT_decl_file("..\ff.h")
   22469                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x9d)
   22470                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
   22471                    
   22472                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
   22473                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   22474                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
   22475                    
   22476                    
   22477                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
   22478                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x18)
   22479                    $C$DW$809       .dwtag  DW_TAG_member
   22480                            .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$21)
   22481                            .dwattr $C$DW$809, DW_AT_name("fsize")
   22482                            .dwattr $C$DW$809, DW_AT_TI_symbol_name("fsize")
   22483                            .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22484                            .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
   22485                            .dwattr $C$DW$809, DW_AT_decl_file("..\ff.h")
   22486                            .dwattr $C$DW$809, DW_AT_decl_line(0xa4)
   22487                            .dwattr $C$DW$809, DW_AT_decl_column(0x0a)
   22488                    
   22489                    $C$DW$810       .dwtag  DW_TAG_member
   22490                            .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
   22491                            .dwattr $C$DW$810, DW_AT_name("fdate")
   22492                            .dwattr $C$DW$810, DW_AT_TI_symbol_name("fdate")
   22493                            .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   22494                            .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
   22495                            .dwattr $C$DW$810, DW_AT_decl_file("..\ff.h")
   22496                            .dwattr $C$DW$810, DW_AT_decl_line(0xa5)
   22497                            .dwattr $C$DW$810, DW_AT_decl_column(0x09)
   22498                    
   22499                    $C$DW$811       .dwtag  DW_TAG_member
   22500                            .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
   22501                            .dwattr $C$DW$811, DW_AT_name("ftime")
   22502                            .dwattr $C$DW$811, DW_AT_TI_symbol_name("ftime")
   22503                            .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   22504                            .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
   22505                            .dwattr $C$DW$811, DW_AT_decl_file("..\ff.h")
   22506                            .dwattr $C$DW$811, DW_AT_decl_line(0xa6)
   22507                            .dwattr $C$DW$811, DW_AT_decl_column(0x09)
   22508                    
   22509                    $C$DW$812       .dwtag  DW_TAG_member
   22510                            .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$19)
   22511                            .dwattr $C$DW$812, DW_AT_name("fattrib")
   22512                            .dwattr $C$DW$812, DW_AT_TI_symbol_name("fattrib")
   22513                            .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   22514                            .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
   22515                            .dwattr $C$DW$812, DW_AT_decl_file("..\ff.h")
   22516                            .dwattr $C$DW$812, DW_AT_decl_line(0xa7)
   22517                            .dwattr $C$DW$812, DW_AT_decl_column(0x09)
   22518                    
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  412

   22519                    $C$DW$813       .dwtag  DW_TAG_member
   22520                            .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$30)
   22521                            .dwattr $C$DW$813, DW_AT_name("fname")
   22522                            .dwattr $C$DW$813, DW_AT_TI_symbol_name("fname")
   22523                            .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   22524                            .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
   22525                            .dwattr $C$DW$813, DW_AT_decl_file("..\ff.h")
   22526                            .dwattr $C$DW$813, DW_AT_decl_line(0xa8)
   22527                            .dwattr $C$DW$813, DW_AT_decl_column(0x0a)
   22528                    
   22529                            .dwattr $C$DW$T$31, DW_AT_decl_file("..\ff.h")
   22530                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xa3)
   22531                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
   22532                            .dwendtag $C$DW$T$31
   22533                    
   22534                    $C$DW$T$87      .dwtag  DW_TAG_typedef
   22535                            .dwattr $C$DW$T$87, DW_AT_name("FILINFO")
   22536                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
   22537                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   22538                            .dwattr $C$DW$T$87, DW_AT_decl_file("..\ff.h")
   22539                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xad)
   22540                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
   22541                    
   22542                    $C$DW$T$95      .dwtag  DW_TAG_const_type
   22543                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$87)
   22544                    
   22545                    $C$DW$T$96      .dwtag  DW_TAG_pointer_type
   22546                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
   22547                            .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
   22548                    
   22549                    $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   22550                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
   22551                            .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   22552                    
   22553                    
   22554                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
   22555                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x224)
   22556                    $C$DW$814       .dwtag  DW_TAG_member
   22557                            .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$25)
   22558                            .dwattr $C$DW$814, DW_AT_name("fs")
   22559                            .dwattr $C$DW$814, DW_AT_TI_symbol_name("fs")
   22560                            .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22561                            .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
   22562                            .dwattr $C$DW$814, DW_AT_decl_file("..\ff.h")
   22563                            .dwattr $C$DW$814, DW_AT_decl_line(0x71)
   22564                            .dwattr $C$DW$814, DW_AT_decl_column(0x0b)
   22565                    
   22566                    $C$DW$815       .dwtag  DW_TAG_member
   22567                            .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
   22568                            .dwattr $C$DW$815, DW_AT_name("id")
   22569                            .dwattr $C$DW$815, DW_AT_TI_symbol_name("id")
   22570                            .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   22571                            .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
   22572                            .dwattr $C$DW$815, DW_AT_decl_file("..\ff.h")
   22573                            .dwattr $C$DW$815, DW_AT_decl_line(0x72)
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  413

   22574                            .dwattr $C$DW$815, DW_AT_decl_column(0x09)
   22575                    
   22576                    $C$DW$816       .dwtag  DW_TAG_member
   22577                            .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$19)
   22578                            .dwattr $C$DW$816, DW_AT_name("flag")
   22579                            .dwattr $C$DW$816, DW_AT_TI_symbol_name("flag")
   22580                            .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   22581                            .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
   22582                            .dwattr $C$DW$816, DW_AT_decl_file("..\ff.h")
   22583                            .dwattr $C$DW$816, DW_AT_decl_line(0x73)
   22584                            .dwattr $C$DW$816, DW_AT_decl_column(0x09)
   22585                    
   22586                    $C$DW$817       .dwtag  DW_TAG_member
   22587                            .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$19)
   22588                            .dwattr $C$DW$817, DW_AT_name("err")
   22589                            .dwattr $C$DW$817, DW_AT_TI_symbol_name("err")
   22590                            .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   22591                            .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
   22592                            .dwattr $C$DW$817, DW_AT_decl_file("..\ff.h")
   22593                            .dwattr $C$DW$817, DW_AT_decl_line(0x74)
   22594                            .dwattr $C$DW$817, DW_AT_decl_column(0x09)
   22595                    
   22596                    $C$DW$818       .dwtag  DW_TAG_member
   22597                            .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$21)
   22598                            .dwattr $C$DW$818, DW_AT_name("fptr")
   22599                            .dwattr $C$DW$818, DW_AT_TI_symbol_name("fptr")
   22600                            .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   22601                            .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
   22602                            .dwattr $C$DW$818, DW_AT_decl_file("..\ff.h")
   22603                            .dwattr $C$DW$818, DW_AT_decl_line(0x75)
   22604                            .dwattr $C$DW$818, DW_AT_decl_column(0x0a)
   22605                    
   22606                    $C$DW$819       .dwtag  DW_TAG_member
   22607                            .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$21)
   22608                            .dwattr $C$DW$819, DW_AT_name("fsize")
   22609                            .dwattr $C$DW$819, DW_AT_TI_symbol_name("fsize")
   22610                            .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   22611                            .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
   22612                            .dwattr $C$DW$819, DW_AT_decl_file("..\ff.h")
   22613                            .dwattr $C$DW$819, DW_AT_decl_line(0x76)
   22614                            .dwattr $C$DW$819, DW_AT_decl_column(0x0a)
   22615                    
   22616                    $C$DW$820       .dwtag  DW_TAG_member
   22617                            .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$21)
   22618                            .dwattr $C$DW$820, DW_AT_name("sclust")
   22619                            .dwattr $C$DW$820, DW_AT_TI_symbol_name("sclust")
   22620                            .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   22621                            .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
   22622                            .dwattr $C$DW$820, DW_AT_decl_file("..\ff.h")
   22623                            .dwattr $C$DW$820, DW_AT_decl_line(0x77)
   22624                            .dwattr $C$DW$820, DW_AT_decl_column(0x0a)
   22625                    
   22626                    $C$DW$821       .dwtag  DW_TAG_member
   22627                            .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$21)
   22628                            .dwattr $C$DW$821, DW_AT_name("clust")
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  414

   22629                            .dwattr $C$DW$821, DW_AT_TI_symbol_name("clust")
   22630                            .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   22631                            .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
   22632                            .dwattr $C$DW$821, DW_AT_decl_file("..\ff.h")
   22633                            .dwattr $C$DW$821, DW_AT_decl_line(0x78)
   22634                            .dwattr $C$DW$821, DW_AT_decl_column(0x0a)
   22635                    
   22636                    $C$DW$822       .dwtag  DW_TAG_member
   22637                            .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$21)
   22638                            .dwattr $C$DW$822, DW_AT_name("dsect")
   22639                            .dwattr $C$DW$822, DW_AT_TI_symbol_name("dsect")
   22640                            .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   22641                            .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
   22642                            .dwattr $C$DW$822, DW_AT_decl_file("..\ff.h")
   22643                            .dwattr $C$DW$822, DW_AT_decl_line(0x79)
   22644                            .dwattr $C$DW$822, DW_AT_decl_column(0x0a)
   22645                    
   22646                    $C$DW$823       .dwtag  DW_TAG_member
   22647                            .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$21)
   22648                            .dwattr $C$DW$823, DW_AT_name("dir_sect")
   22649                            .dwattr $C$DW$823, DW_AT_TI_symbol_name("dir_sect")
   22650                            .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   22651                            .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
   22652                            .dwattr $C$DW$823, DW_AT_decl_file("..\ff.h")
   22653                            .dwattr $C$DW$823, DW_AT_decl_line(0x7b)
   22654                            .dwattr $C$DW$823, DW_AT_decl_column(0x0a)
   22655                    
   22656                    $C$DW$824       .dwtag  DW_TAG_member
   22657                            .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$26)
   22658                            .dwattr $C$DW$824, DW_AT_name("dir_ptr")
   22659                            .dwattr $C$DW$824, DW_AT_TI_symbol_name("dir_ptr")
   22660                            .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   22661                            .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
   22662                            .dwattr $C$DW$824, DW_AT_decl_file("..\ff.h")
   22663                            .dwattr $C$DW$824, DW_AT_decl_line(0x7c)
   22664                            .dwattr $C$DW$824, DW_AT_decl_column(0x0a)
   22665                    
   22666                    $C$DW$825       .dwtag  DW_TAG_member
   22667                            .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$22)
   22668                            .dwattr $C$DW$825, DW_AT_name("buf")
   22669                            .dwattr $C$DW$825, DW_AT_TI_symbol_name("buf")
   22670                            .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   22671                            .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
   22672                            .dwattr $C$DW$825, DW_AT_decl_file("..\ff.h")
   22673                            .dwattr $C$DW$825, DW_AT_decl_line(0x85)
   22674                            .dwattr $C$DW$825, DW_AT_decl_column(0x09)
   22675                    
   22676                            .dwattr $C$DW$T$32, DW_AT_decl_file("..\ff.h")
   22677                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x70)
   22678                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
   22679                            .dwendtag $C$DW$T$32
   22680                    
   22681                    $C$DW$T$73      .dwtag  DW_TAG_typedef
   22682                            .dwattr $C$DW$T$73, DW_AT_name("FIL")
   22683                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$32)
TI ARM Assembler PC v16.9.6 Sun Dec 02 13:28:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
ff.asm                                                               PAGE  415

   22684                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
   22685                            .dwattr $C$DW$T$73, DW_AT_decl_file("..\ff.h")
   22686                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x87)
   22687                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
   22688                    
   22689                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
   22690                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
   22691                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
   22692                    
   22693                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
   22694                            .dwattr $C$DW$T$2, DW_AT_name("void")
   22695                    
   22696                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
   22697                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
   22698                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
   22699                    
   22700                    $C$DW$T$78      .dwtag  DW_TAG_const_type
   22701                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$2)
   22702                    
   22703                    $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   22704                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
   22705                            .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   22706                    
   22707                    $C$DW$T$4       .dwtag  DW_TAG_base_type
   22708                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   22709                            .dwattr $C$DW$T$4, DW_AT_name("bool")
   22710                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   22711                    
   22712                    $C$DW$T$5       .dwtag  DW_TAG_base_type
   22713                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
   22714                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
   22715                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   22716                    
   22717                    $C$DW$T$6       .dwtag  DW_TAG_base_type
   22718                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   22719                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   22720                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   22721                    
   22722                    $C$DW$T$19      .dwtag  DW_TAG_typedef
   22723                            .dwattr $C$DW$T$19, DW_AT_name("BYTE")
   22724                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
   22725                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
