;******************************************************************************
;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
;* Date/Time created: Sun Dec 02 13:28:43 2018                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../picojpeg.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\brian\Documents\EE445L\Lab11\Test\Debug")
	.sect	".const:.string:ZAG"
	.clink
	.align	1
	.elfsym	ZAG,SYM_SIZE(64)
ZAG:
	.bits	0,8			; ZAG[0] @ 0
	.bits	1,8			; ZAG[1] @ 8
	.bits	8,8			; ZAG[2] @ 16
	.bits	16,8			; ZAG[3] @ 24
	.bits	9,8			; ZAG[4] @ 32
	.bits	2,8			; ZAG[5] @ 40
	.bits	3,8			; ZAG[6] @ 48
	.bits	10,8			; ZAG[7] @ 56
	.bits	17,8			; ZAG[8] @ 64
	.bits	24,8			; ZAG[9] @ 72
	.bits	32,8			; ZAG[10] @ 80
	.bits	25,8			; ZAG[11] @ 88
	.bits	18,8			; ZAG[12] @ 96
	.bits	11,8			; ZAG[13] @ 104
	.bits	4,8			; ZAG[14] @ 112
	.bits	5,8			; ZAG[15] @ 120

	.dwattr $C$DW$825, DW_AT_decl_column(0x04)

$C$DW$826	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$826, DW_AT_name("M_RST4")
	.dwattr $C$DW$826, DW_AT_const_value(0xd4)
	.dwattr $C$DW$826, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$826, DW_AT_decl_line(0x65)
	.dwattr $C$DW$826, DW_AT_decl_column(0x04)

$C$DW$827	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$827, DW_AT_name("M_RST5")
	.dwattr $C$DW$827, DW_AT_const_value(0xd5)
	.dwattr $C$DW$827, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$827, DW_AT_decl_line(0x66)
	.dwattr $C$DW$827, DW_AT_decl_column(0x04)

$C$DW$828	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$828, DW_AT_name("M_RST6")
	.dwattr $C$DW$828, DW_AT_const_value(0xd6)
	.dwattr $C$DW$828, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$828, DW_AT_decl_line(0x67)
	.dwattr $C$DW$828, DW_AT_decl_column(0x04)

$C$DW$829	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$829, DW_AT_name("M_RST7")
	.dwattr $C$DW$829, DW_AT_const_value(0xd7)
	.dwattr $C$DW$829, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$829, DW_AT_decl_line(0x68)
	.dwattr $C$DW$829, DW_AT_decl_column(0x04)

$C$DW$830	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$830, DW_AT_name("M_SOI")
	.dwattr $C$DW$830, DW_AT_const_value(0xd8)
	.dwattr $C$DW$830, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$830, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$830, DW_AT_decl_column(0x04)

$C$DW$831	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$831, DW_AT_name("M_EOI")
	.dwattr $C$DW$831, DW_AT_const_value(0xd9)
	.dwattr $C$DW$831, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$831, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$831, DW_AT_decl_column(0x04)

$C$DW$832	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$832, DW_AT_name("M_SOS")
	.dwattr $C$DW$832, DW_AT_const_value(0xda)
	.dwattr $C$DW$832, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$832, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$832, DW_AT_decl_column(0x04)

$C$DW$833	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$833, DW_AT_name("M_DQT")
	.dwattr $C$DW$833, DW_AT_const_value(0xdb)
	.dwattr $C$DW$833, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$833, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$833, DW_AT_decl_column(0x04)

$C$DW$834	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$834, DW_AT_name("M_DNL")
	.dwattr $C$DW$834, DW_AT_const_value(0xdc)
	.dwattr $C$DW$834, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$834, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$834, DW_AT_decl_column(0x04)

$C$DW$835	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$835, DW_AT_name("M_DRI")
	.dwattr $C$DW$835, DW_AT_const_value(0xdd)
	.dwattr $C$DW$835, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$835, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$835, DW_AT_decl_column(0x04)

$C$DW$836	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$836, DW_AT_name("M_DHP")
	.dwattr $C$DW$836, DW_AT_const_value(0xde)
	.dwattr $C$DW$836, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$836, DW_AT_decl_line(0x70)
	.dwattr $C$DW$836, DW_AT_decl_column(0x04)

$C$DW$837	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$837, DW_AT_name("M_EXP")
	.dwattr $C$DW$837, DW_AT_const_value(0xdf)
	.dwattr $C$DW$837, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$837, DW_AT_decl_line(0x71)
	.dwattr $C$DW$837, DW_AT_decl_column(0x04)

$C$DW$838	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$838, DW_AT_name("M_APP0")
	.dwattr $C$DW$838, DW_AT_const_value(0xe0)
	.dwattr $C$DW$838, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$838, DW_AT_decl_line(0x73)
	.dwattr $C$DW$838, DW_AT_decl_column(0x04)

$C$DW$839	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$839, DW_AT_name("M_APP15")
	.dwattr $C$DW$839, DW_AT_const_value(0xef)
	.dwattr $C$DW$839, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$839, DW_AT_decl_line(0x74)
	.dwattr $C$DW$839, DW_AT_decl_column(0x04)

$C$DW$840	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$840, DW_AT_name("M_JPG0")
	.dwattr $C$DW$840, DW_AT_const_value(0xf0)
	.dwattr $C$DW$840, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$840, DW_AT_decl_line(0x76)
	.dwattr $C$DW$840, DW_AT_decl_column(0x04)

$C$DW$841	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$841, DW_AT_name("M_JPG13")
	.dwattr $C$DW$841, DW_AT_const_value(0xfd)
	.dwattr $C$DW$841, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$841, DW_AT_decl_line(0x77)
	.dwattr $C$DW$841, DW_AT_decl_column(0x04)

$C$DW$842	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$842, DW_AT_name("M_COM")
	.dwattr $C$DW$842, DW_AT_const_value(0xfe)
	.dwattr $C$DW$842, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$842, DW_AT_decl_line(0x78)
	.dwattr $C$DW$842, DW_AT_decl_column(0x04)

$C$DW$843	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$843, DW_AT_name("M_TEM")
	.dwattr $C$DW$843, DW_AT_const_value(0x01)
	.dwattr $C$DW$843, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$843, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$843, DW_AT_decl_column(0x04)

$C$DW$844	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$844, DW_AT_name("M_ERROR")
	.dwattr $C$DW$844, DW_AT_const_value(0x100)
	.dwattr $C$DW$844, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$844, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$844, DW_AT_decl_column(0x04)

$C$DW$845	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$845, DW_AT_name("RST0")
	.dwattr $C$DW$845, DW_AT_const_value(0xd0)
	.dwattr $C$DW$845, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$845, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$845, DW_AT_decl_column(0x04)

	.dwattr $C$DW$T$29, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$29

$C$DW$T$30	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$30, DW_AT_name("JPEG_MARKER")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x03)


$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x2c)
$C$DW$846	.dwtag  DW_TAG_member
	.dwattr $C$DW$846, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$846, DW_AT_name("m_width")
	.dwattr $C$DW$846, DW_AT_TI_symbol_name("m_width")
	.dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$846, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$846, DW_AT_decl_line(0x42)
	.dwattr $C$DW$846, DW_AT_decl_column(0x08)

$C$DW$847	.dwtag  DW_TAG_member
	.dwattr $C$DW$847, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$847, DW_AT_name("m_height")
	.dwattr $C$DW$847, DW_AT_TI_symbol_name("m_height")
	.dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$847, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$847, DW_AT_decl_line(0x43)
	.dwattr $C$DW$847, DW_AT_decl_column(0x08)

$C$DW$848	.dwtag  DW_TAG_member
	.dwattr $C$DW$848, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$848, DW_AT_name("m_comps")
	.dwattr $C$DW$848, DW_AT_TI_symbol_name("m_comps")
	.dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$848, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$848, DW_AT_decl_line(0x46)
	.dwattr $C$DW$848, DW_AT_decl_column(0x08)

$C$DW$849	.dwtag  DW_TAG_member
	.dwattr $C$DW$849, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$849, DW_AT_name("m_MCUSPerRow")
	.dwattr $C$DW$849, DW_AT_TI_symbol_name("m_MCUSPerRow")
	.dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$849, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$849, DW_AT_decl_line(0x49)
	.dwattr $C$DW$849, DW_AT_decl_column(0x08)

$C$DW$850	.dwtag  DW_TAG_member
	.dwattr $C$DW$850, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$850, DW_AT_name("m_MCUSPerCol")
	.dwattr $C$DW$850, DW_AT_TI_symbol_name("m_MCUSPerCol")
	.dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$850, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$850, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$850, DW_AT_decl_column(0x08)

$C$DW$851	.dwtag  DW_TAG_member
	.dwattr $C$DW$851, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$851, DW_AT_name("m_scanType")
	.dwattr $C$DW$851, DW_AT_TI_symbol_name("m_scanType")
	.dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$851, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$851, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$851, DW_AT_decl_column(0x16)

$C$DW$852	.dwtag  DW_TAG_member
	.dwattr $C$DW$852, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$852, DW_AT_name("m_MCUWidth")
	.dwattr $C$DW$852, DW_AT_TI_symbol_name("m_MCUWidth")
	.dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$852, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$852, DW_AT_decl_line(0x50)
	.dwattr $C$DW$852, DW_AT_decl_column(0x08)

$C$DW$853	.dwtag  DW_TAG_member
	.dwattr $C$DW$853, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$853, DW_AT_name("m_MCUHeight")
	.dwattr $C$DW$853, DW_AT_TI_symbol_name("m_MCUHeight")
	.dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$853, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$853, DW_AT_decl_line(0x51)
	.dwattr $C$DW$853, DW_AT_decl_column(0x08)

$C$DW$854	.dwtag  DW_TAG_member
	.dwattr $C$DW$854, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$854, DW_AT_name("m_pMCUBufR")
	.dwattr $C$DW$854, DW_AT_TI_symbol_name("m_pMCUBufR")
	.dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$854, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$854, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$854, DW_AT_decl_column(0x13)

$C$DW$855	.dwtag  DW_TAG_member
	.dwattr $C$DW$855, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$855, DW_AT_name("m_pMCUBufG")
	.dwattr $C$DW$855, DW_AT_TI_symbol_name("m_pMCUBufG")
	.dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$855, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$855, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$855, DW_AT_decl_column(0x13)

$C$DW$856	.dwtag  DW_TAG_member
	.dwattr $C$DW$856, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$856, DW_AT_name("m_pMCUBufB")
	.dwattr $C$DW$856, DW_AT_TI_symbol_name("m_pMCUBufB")
	.dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$856, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$856, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$856, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$22

$C$DW$T$31	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$31, DW_AT_name("pjpeg_image_info_t")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x03)

$C$DW$T$32	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$32, DW_AT_address_class(0x20)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_name("HuffTableT")
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x50)
$C$DW$857	.dwtag  DW_TAG_member
	.dwattr $C$DW$857, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$857, DW_AT_name("mMinCode")
	.dwattr $C$DW$857, DW_AT_TI_symbol_name("mMinCode")
	.dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$857, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$857, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$857, DW_AT_decl_column(0x0b)

$C$DW$858	.dwtag  DW_TAG_member
	.dwattr $C$DW$858, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$858, DW_AT_name("mMaxCode")
	.dwattr $C$DW$858, DW_AT_TI_symbol_name("mMaxCode")
	.dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$858, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$858, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$858, DW_AT_decl_column(0x0b)

$C$DW$859	.dwtag  DW_TAG_member
	.dwattr $C$DW$859, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$859, DW_AT_name("mValPtr")
	.dwattr $C$DW$859, DW_AT_TI_symbol_name("mValPtr")
	.dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$859, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$859, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$859, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$27, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$27

$C$DW$T$33	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$33, DW_AT_name("HuffTable")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$33, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x03)

$C$DW$T$34	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)

$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x20)

$C$DW$T$36	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x20)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$54	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$54, DW_AT_name("int8")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$54, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x13)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x19)

$C$DW$T$55	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)


$C$DW$T$56	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x40)
$C$DW$860	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$860, DW_AT_upper_bound(0x3f)

	.dwendtag $C$DW$T$56

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$21	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$21, DW_AT_address_class(0x20)


$C$DW$T$59	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
$C$DW$861	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$861, DW_AT_type(*$C$DW$T$21)

$C$DW$862	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$862, DW_AT_type(*$C$DW$T$6)

$C$DW$863	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$863, DW_AT_type(*$C$DW$T$21)

$C$DW$864	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$864, DW_AT_type(*$C$DW$T$3)

	.dwendtag $C$DW$T$59

$C$DW$T$60	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$60, DW_AT_address_class(0x20)

$C$DW$T$61	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$61, DW_AT_name("pjpeg_need_bytes_callback_t")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$61, DW_AT_decl_file("..\picojpeg.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x19)

$C$DW$T$25	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$25, DW_AT_name("uint8")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$25, DW_AT_decl_file("../picojpeg.c")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x11)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x19)


$C$DW$T$26	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
